Revit 2024 API
SpecTypeId.PipingRoughness Property
 Roughness, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipingRoughness { get; }
Visual Basic
Public Shared ReadOnly Property PipingRoughness As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipingRoughness {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace